README.org

* To execute tests:
** All test
#+BEGIN_SRC sh
$ cd dameformats
$ ./runtests.sh
#+END_SRC
** Single test's file
#+BEGIN_SRC sh
$ cd dameformats
$ pytest tests
#+END_SRC
** Single test
#+BEGIN_SRC sh
$ cd dameformats
$ pytest tests/test_damecsv.py::TestDameCsv::test_damecsv_csvcolumn2list 
#+END_SRC

* Pypi
+ To install from local:
#+BEGIN_SRC sh
$ pip install -e .
#+END_SRC

+ To install create tar.gz in dist directory:
#+BEGIN_SRC src
$ python3 setup.py register sdist
#+END_SRC

+ To upload to pypi:
#+BEGIN_SRC src
$ twine upload dist/dameformats-0.1.tar.gz
#+END_SRC

+ You can install from Internet in a python virtual environment to check:
#+BEGIN_SRC src
$ python3 -m venv /tmp/funny
$ cd /tmp/funny
$ source bin/activate
$ pip3 install dameformats
#+END_SRC
